export const InitialTasks = [
  {
    name: 'DBモデリング1',
  },
  {
    name: 'DBモデリング2',
  },
  {
    name: 'DBモデリング3',
  },
  {
    name: 'DBモデリング4',
  },
  {
    name: 'DBモデリング5',
  },
  {
    name: 'データベース設計のアンチパターンを学ぶ1',
  },
  {
    name: 'データベース設計のアンチパターンを学ぶ2',
  },
  {
    name: 'データベース設計のアンチパターンを学ぶ3',
  },
  {
    name: 'データベース設計のアンチパターンを学ぶ4',
  },
  {
    name: 'データベース設計のアンチパターンを学ぶ5',
  },
  {
    name: 'データベース設計のアンチパターンを学ぶ6',
  },
  {
    name: 'データベース設計のアンチパターンを学ぶ7',
  },
  {
    name: 'データベース設計のアンチパターンを学ぶ8',
  },
  {
    name: 'データベース設計のアンチパターンを学ぶ9',
  },
  {
    name: 'アンチパターンを踏まえてDBモデリングを見直そう',
  },
  {
    name: 'マルチテナントについて',
  },
  {
    name: '外部キー制約について考える',
  },
  {
    name: 'データベースにおけるNULLの扱い',
  },
  {
    name: 'jestで単体テストを書こう',
  },
  {
    name: 'storybookを作ろう',
  },
  {
    name: 'スナップショットテストを書こう',
  },
  {
    name: 'ビジュアル・リグレッションテストを書こう',
  },
  {
    name: 'E2Eテストを書こう',
  },
  {
    name: 'TDD（テスト駆動開発）でコードを書いてみる',
  },
  {
    name: '基本的な設計原則',
  },
  {
    name: 'オニオンアーキテクチャを学ぶ',
  },
  {
    name: 'DDDを学ぶ（基礎）',
  },
  {
    name: '特大課題：プラハチャレンジをDDDで実装してみる',
  },
  {
    name: 'DDDを学ぶ（応用）',
  },
  {
    name: 'リファクタリング',
  },
]
